moggiozzi/stm32tests/usr_src/test.c
#include "stdio.h"

#include "stm32f7xx_hal.h"
#include "stm32f7xx_hal_def.h"
#include "stm32f7xx_hal_flash.h"
#include "stm32f7xx_hal_flash_ex.h"

uint32_t sector_size[]={
16,16,16,16,64,128,128,128
};

HAL_StatusTypeDef setWriteProtect(void){
	HAL_StatusTypeDef res = HAL_OK;
	FLASH_OBProgramInitTypeDef ob;
	FLASH_OBProgramInitTypeDef *pOBInit = &ob;
	HAL_FLASHEx_OBGetConfig(pOBInit);
	pOBInit->OptionType = OPTIONBYTE_WRP;
	pOBInit->WRPState = OB_WRPSTATE_ENABLE;
	pOBInit->WRPSector = OB_WRP_SECTOR_0 | OB_WRP_SECTOR_1;
	res |= HAL_FLASH_Unlock();
	res |= HAL_FLASH_OB_Unlock();
	res |= HAL_FLASHEx_OBProgram(pOBInit);
	res |= HAL_FLASH_OB_Launch();
	res |= HAL_FLASH_OB_Lock();
	return res;
}

HAL_StatusTypeDef setReadProtectL1(void){
	HAL_StatusTypeDef res = HAL_OK;
	FLASH_OBProgramInitTypeDef ob;
	FLASH_OBProgramInitTypeDef *pOBInit = &ob;
	HAL_FLASHEx_OBGetConfig(pOBInit);
	pOBInit->OptionType = OPTIONBYTE_RDP;
	pOBInit->RDPLevel = OB_RDP_LEVEL_1;
	res |= HAL_FLASH_Unlock();
	res |= HAL_FLASH_OB_Unlock();
	res |= HAL_FLASHEx_OBProgram(pOBInit);
	res |= HAL_FLASH_OB_Launch();
	res |= HAL_FLASH_OB_Lock();
	return res;
}

// !!!ѕосле выполнени€ этого кода не удаетс€ подключитьс€ к плате!!!
//ƒолго тыкалс€, вот так вылечилось:
//1) Target -> Settings: Mode HotPlug
//2) Option Bytes: Level 1, PCROP_RDP checked
//3) Option Bytes: Level 0
//-нельз€ примен€ть вместе с writeProtection
//-нельз€ примен€ть к сектору с вектором прерываний
HAL_StatusTypeDef setReadProtect(void){
	HAL_StatusTypeDef res = HAL_OK;
	FLASH_OBProgramInitTypeDef ob;
	FLASH_OBProgramInitTypeDef *pOBInit = &ob;
	HAL_FLASHEx_OBGetConfig(pOBInit);
    pOBInit->OptionType = OPTIONBYTE_PCROP;
    pOBInit->PCROPSector = OB_PCROP_SECTOR_0 | OB_PCROP_SECTOR_1;
	res |= HAL_FLASH_Unlock();
	res |= HAL_FLASH_OB_Unlock();
	res |= HAL_FLASHEx_OBProgram(pOBInit);
	res |= HAL_FLASH_OB_Launch();
	res |= HAL_FLASH_OB_Lock();
	return res;
}

HAL_StatusTypeDef setReadProtect2(void){
	HAL_StatusTypeDef res = HAL_OK;
	FLASH_OBProgramInitTypeDef ob;
	FLASH_OBProgramInitTypeDef *pOBInit = &ob;
	HAL_FLASHEx_OBGetConfig(pOBInit);
    pOBInit->OptionType = OPTIONBYTE_PCROP_RDP;
    pOBInit->PCROPRdp = OB_PCROP_RDP_ENABLE;
	res |= HAL_FLASH_Unlock();
	res |= HAL_FLASH_OB_Unlock();
	res |= HAL_FLASHEx_OBProgram(pOBInit);
	res |= HAL_FLASH_OB_Launch();
	res |= HAL_FLASH_OB_Lock();
	return res;
}

void test(void){
  HAL_StatusTypeDef res = setReadProtect2();

  printf("Hello %d\r\n", res);
}
